digitalocean-ubuntu-siege-tsung/tsung.xml
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd" []>
<tsung loglevel="warning">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="30000000"/>
  </clients>

  <servers>
    <server host="ya.ru" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="1" unit="minute">
	<users arrivalrate="10" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="2" unit="minute">
	<users arrivalrate="25" unit="second"/>
    </arrivalphase>
  </load>

  <sessions>
   <session name="rec20111101-1537" probability="100" type="ts_http">
        <request><http url="/index.html" version="1.1" method="GET"/></request>
        <!-- <request><http url="/css/global_mainPage.css" version="1.1" method="GET"/></request>
        
        <thinktime random="true" value="15"/> -->
   </session>
  </sessions>
</tsung>